package zadachnik;

public class Zadaniya {

    /*
    --------------------------------------------------------------------------------------------------------
    Создать класс май класс с мейн методом - int 2шт и 1 массив из 4 чисел. Создать функции:
// 1) максимум из двух чисел и она возвращает число, которое больше
// 2) сумму элементов массива
// 3) в которую передается массив и если число из массива не равно 25, то он выводит его на экран
// из метода мейн вызвать 3 метода и вывести на экран ответы

//Создать класс любого предмета, который нас окружает с тремя атрибутами и тремя методами. С май класса создать этот объект и вызвать его функции
--------------------------------------------------------------------------------------------------------
Написать функцию в uroki.MyClass2 которая получает параметр число и
1) если число = 1, то выводин на экран - "одна минута до конца урока"
2) если число = 5, то выводин на экран - "пять минута до конца урока"
3) если число = 10, то выводин на экран - "десять минута до конца урока"
4) в остальных случаях "еще слишком рано"
в main создать массив из чисел, пробежаться по всем и вызвать функцию эту, которая была

Задание со *
Написать функцию, которая возвращает сумму двух чисел, если первое число больше 2 и второе число больше 0 и меньше 100 - вывести на экран результат,
в противном случае вывести на экран, что числа не подходят
--------------------------------------------------------------------------------------------------------
1) Добавить конструктор в класс микровэйв/кофемашина - 1 по умолчанию, 1 с одним параметром, 1 с 3 параметрами и все 3 параметра инициализируются.
 В мэйн методе создать три объекта классов, каждый с конструктором, который создали в первом задании.
  2) Создать еще один класс с двумя атрибутами private. Написать для них геттеры и сеттеры. В мэйн методе создать элемент класса, задать ему сеттерами значения
и вывести на экран значения.
        3) Написать функцию в май классе, которая получает три параметра, если первый параметр больше второго = из первого вычитает второй. Если второй больше первого,
 то вычитает из второго первый. И, полученное значение, умножает на третье и возвращает число.
--------------------------------------------------------------------------------------------------------
1)Имеется двухмерный массив (фото в телеге). Написать две функции - 1. Вычесляет сумму всеъ элементов. 2. Вычесляет сумму элементов каждого столбца
и возвращает одномерный массив из этих элементов.
2) Прочитать в солоLearn до приведения типов.
3) Написать функцию, которая возвращает среднее арифметическое из двух чисел с плавающей точкой (суммируешь и делёшь на два)
--------------------------------------------------------------------------------------------------------
1.Необходимо вывести на экран числа от 5 до 1 через пробел (5 4 3 ..) с использованием одной переменной
2. Вывести на экран таблицу умножения на 3 (фото в телеге) Один в один. Название нормальное ставтье!!
3. Необходимо вывести на экран след последовательность:
7 14 21 28 35 42 49 56 63 70 77 84 91 98
компактно, симпатично и все с использованием while
--------------------------------------------------------------------------------------------------------
1. В телеге !(!делаем! !по! !очередности!)!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
2. Песочные часы доделай
--------------------------------------------------------------------------------------------------------

--------------------------------------------------------------------------------------------------------

--------------------------------------------------------------------------------------------------------
     */
}
